In [1]:
# import dependencies

import pandas as pd
import numpy as np
import datetime

In [2]:
# read csv file

raw_data = pd.read_csv('employee_data.csv')
raw_data.head()

   Emp ID              Name         DOB          SSN         State
0     232      John Mathews  1991-02-24  289-31-9165  North Dakota
1     533      Nathan Moore  1978-11-19  220-05-7469         Maine
2     256    Amanda Douglas  1990-01-08  564-27-6961         Idaho
3     189   Heather Andrews  1976-08-11  742-79-1797       Vermont
4     284  Daniel Hernandez  1976-07-22  656-01-7473      Colorado

In [3]:
# split name column into separate first name and last name columns

first = []
last = []

for name in raw_data['Name']:
    first.append(name.split()[0])
    last.append(name.split()[1])
    
raw_data['First Name'] = first
raw_data['Last Name'] = last

In [4]:
# rewrite DOB into MM/DD/YYYY format

new_dob = []

for dob in raw_data['DOB']:
    dob = datetime.datetime.strptime(dob, '%Y-%m-%d').strftime('%m/%d/%Y')
    new_dob.append(dob)

raw_data['DOB'] = new_dob

In [5]:
# hide the first five numbers in the SSN data

new_ssn = []

for ssn in raw_data['SSN']:
    ssn = ssn.replace(ssn[0:6], '***-**')
    new_ssn.append(ssn)

raw_data['SSN'] = new_ssn

In [6]:
# rewrite state as two-letter abbreviations

from us_state_abbrev import us_state_abbrev

abb_state = []

for state in raw_data['State']:
    state = us_state_abbrev[state]
    abb_state.append(state)

raw_data['State'] = state

In [7]:
# reorder and remove old columns from dataframe

cleaned = raw_data.drop(columns = ['Name'])
cleaned = cleaned[['Emp ID','First Name','Last Name','DOB','SSN','State']]

cleaned.head()

   Emp ID First Name  Last Name         DOB          SSN State
0     232       John    Mathews  02/24/1991  ***-**-9165    OR
1     533     Nathan      Moore  11/19/1978  ***-**-7469    OR
2     256     Amanda    Douglas  01/08/1990  ***-**-6961    OR
3     189    Heather    Andrews  08/11/1976  ***-**-1797    OR
4     284     Daniel  Hernandez  07/22/1976  ***-**-7473    OR

In [8]:
# export new data file

cleaned.to_csv('new_employee_data.csv')